In [13]:
import pandas as pd
import numpy as np
d1 = {"id":[1,2,3,4], 
        "first":['a','b','c','d'],
         "last":['e','f','g','h']}

In [19]:
d2 = {"id2":[1,2,3,4],
        "first2":['a','b','c','z'],
         "last2":['e','f','g','h']}

In [20]:
df1 = pd.DataFrame(d1)

In [21]:
df1

   id first last
0   1     a    e
1   2     b    f
2   3     c    g
3   4     d    h

In [22]:
df2 = pd.DataFrame(d2)

In [23]:
df2

   id2 first2 last2
0    1      a     e
1    2      b     f
2    3      c     g
3    4      z     h

In [27]:
d1 = pd.merge(df1,df2,how= 'outer',left_on="id", right_on="id2",)

In [28]:
d1

   id first last  id2 first2 last2
0   1     a    e    1      a     e
1   2     b    f    2      b     f
2   3     c    g    3      c     g
3   4     d    h    4      z     h

In [30]:
look_up = {"sourse":["id","first","last"],
            "target":["id2","first2","last2"]}

In [31]:
dlookup = pd.DataFrame(look_up)

In [32]:
dlookup

  sourse  target
0     id     id2
1  first  first2
2   last   last2

In [35]:
dic = dlookup.to_dict()

In [49]:
dic

{'sourse': {0: 'id', 1: 'first', 2: 'last'},
 'target': {0: 'id2', 1: 'first2', 2: 'last2'}}

In [50]:
sourse = dic["sourse"]

In [54]:
target = dic["target"]

In [55]:
length = len(sourse)

In [56]:
length

3

In [89]:
for i in range (length):
    sour = sourse[1]
    tar  = target[1]
    for j in range (len(d1)):
        d1[sour+tar][j] = d1[sour][j] == d1[tar][j]
        print(d1[sour+tar])
        print(d1[sour][j])
        print(d1[tar][j])

0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
a
a
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
b
b
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
c
c
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
d
z
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
a
a
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
b
b
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
c
c
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
d
z
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
a
a
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
b
b
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
c
c
0     True
1     True
2     True
3    False
Name: firstfirst2, dtype: bool
d
z

C:\Users\sseelam\AppData\Local\Temp\ipykernel_7388\4267588819.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d1[sour+tar][j] = d1[sour][j] == d1[tar][j]

In [90]:
d1

   id first last  id2 first2 last2  idid2  firstfirst2  lastlast2
0   1     a    e    1      a     e   True         True       True
1   2     b    f    2      b     f   True         True       True
2   3     c    g    3      c     g   True         True       True
3   4     d    h    4      z     h   True        False       True

In [94]:
list = []
for i in range (length):
    sour = sourse[i]
    tar  = target[i]
    list.append(sour)
    list.append(tar)
    list.append(sour+tar)
print(list)

['id', 'id2', 'idid2', 'first', 'first2', 'firstfirst2', 'last', 'last2', 'lastlast2']

In [95]:
d1[list]

   id  id2  idid2 first first2  firstfirst2 last last2  lastlast2
0   1    1   True     a      a         True    e     e       True
1   2    2   True     b      b         True    f     f       True
2   3    3   True     c      c         True    g     g       True
3   4    4   True     d      z        False    h     h       True